RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Src/stm32h5xx_hal_gtzc.c
  /* check descriptor content vs. memory capacity */
  switch (MemBaseAddress)
  {
#if defined(OCTOSPI1)
    case OCTOSPI1_BASE:
      size = GTZC_TZSC_MPCWM1_MEM_SIZE;
      if (pMPCWM_Desc->AreaId == GTZC_TZSC_MPCWM_ID1)
      {
        register_address = (uint32_t) &(GTZC_TZSC1->MPCWM1AR);
      }
      else
      {
        /* Here pMPCWM_Desc->AreaId == GTZC_TZSC_MPCWM_ID2
         * (Parameter already checked)
         */
        register_address = (uint32_t) &(GTZC_TZSC1->MPCWM1BR);
      }
      break;
#endif /* (OCTOSPI1) */
#if defined(FMC_BANK1)
    case FMC_BANK1:
      size = GTZC_TZSC_MPCWM2_MEM_SIZE;
      if (pMPCWM_Desc->AreaId == GTZC_TZSC_MPCWM_ID1)
      {
        register_address = (uint32_t) &(GTZC_TZSC1->MPCWM2AR);
      }
      else
      {
        /* Here pMPCWM_Desc->AreaId == GTZC_TZSC_MPCWM_ID2
         * (Parameter already checked)
         */
        register_address = (uint32_t) &(GTZC_TZSC1->MPCWM2BR);
      }
      break;
#endif /* defined(FMC_BANK1) */
#if defined(FMC_BANK3)
    case FMC_BANK3:
      /* Here pMPCWM_Desc->AreaId == GTZC_TZSC_MPCWM_ID1
       * (Parameter already checked)
       */
      size = GTZC_TZSC_MPCWM3_MEM_SIZE;
      register_address = (uint32_t) &(GTZC_TZSC1->MPCWM3AR);
      break;
#endif /* defined(FMC_BANK3) */
#if defined(FMC_SDRAM_BANK_1)
    case FMC_SDRAM_BANK_1:
      /* Here pMPCWM_Desc->AreaId == GTZC_TZSC_MPCWM_ID1
       * (Parameter already checked)
       */
      size = GTZC_TZSC_MPCWM3_MEM_SIZE;
      register_address = (uint32_t) &(GTZC_TZSC1->MPCWM3AR);
      break;
#endif /* (FMC_SDRAM_BANK_1) */
#if defined(BKPSRAM_BASE)
    case BKPSRAM_BASE:
      /* Here pMPCWM_Desc->AreaId == GTZC_TZSC_MPCWM_ID1
       * (Parameter already checked)
       */
      size = GTZC_TZSC_MPCWM4_MEM_SIZE;
      register_address = (uint32_t) &(GTZC_TZSC1->MPCWM4AR);
      break;
#endif /* (BKPSRAM_BASE) */
#if defined(FMC_SDRAM_BANK_2)
    case FMC_SDRAM_BANK_2:
      /* Here pMPCWM_Desc->AreaId == GTZC_TZSC_MPCWM_ID1
       * (Parameter already checked)
       */
      size = GTZC_TZSC_MPCWM4_SDRAM_MEM_SIZE ;
      register_address = (uint32_t) &(GTZC_TZSC1->MPCWM4AR);
      break;
#endif /* (FMC_SDRAM_BANK_2) */
    default:
      return HAL_ERROR;
      break;
  }

  if ((pMPCWM_Desc->Offset > size)
      || ((pMPCWM_Desc->Offset
           + pMPCWM_Desc->Length)
          > size))
  {
    return HAL_ERROR;
  }

  /* Write watermark start and length value */
  reg_value = ((pMPCWM_Desc->Offset / granularity)
               << GTZC_TZSC_MPCWMR_SUBZ_START_Pos) & GTZC_TZSC_MPCWMR_SUBZ_START_Msk;
  reg_value |= ((pMPCWM_Desc->Length / granularity)
                << GTZC_TZSC_MPCWMR_SUBZ_LENGTH_Pos) & GTZC_TZSC_MPCWMR_SUBZ_LENGTH_Msk;
  MODIFY_REG(*(__IO uint32_t *)register_address, GTZC_TZSC_MPCWMR_SUBZ_START_Msk | \
             GTZC_TZSC_MPCWMR_SUBZ_LENGTH_Msk, reg_value);

#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  /* Write watermark configuration value */
  reg_value = (pMPCWM_Desc->Attribute << GTZC_TZSC_MPCWM_CFGR_SEC_Pos) | \
              pMPCWM_Desc->Lock                                  | \
              pMPCWM_Desc->AreaStatus;
  MODIFY_REG(*(__IO uint32_t *)(register_address - 4U), (GTZC_TZSC_MPCWM_CFGR_PRIV | GTZC_TZSC_MPCWM_CFGR_SEC | \
                                                         GTZC_TZSC_MPCWM_CFGR_SRLOCK | GTZC_TZSC_MPCWM_CFGR_SREN), \
             reg_value);
#else
  /* Write watermark configuration value */
  reg_value = (pMPCWM_Desc->Attribute << (GTZC_TZSC_MPCWM_CFGR_PRIV_Pos - 1U)) | \
              pMPCWM_Desc->Lock                                  | \
              pMPCWM_Desc->AreaStatus;
  MODIFY_REG(*(__IO uint32_t *)(register_address - 4U), (GTZC_TZSC_MPCWM_CFGR_PRIV | GTZC_TZSC_MPCWM_CFGR_SRLOCK | \
                                                         GTZC_TZSC_MPCWM_CFGR_SREN), reg_value);
#endif /* (__ARM_FEATURE_CMSE) */

  return HAL_OK;
}

/**
  * @brief  Get a TZSC-MPCWM area configuration.
  * @param  MemBaseAddress WM identifier.
  * @param  pMPCWM_Desc pointer to a TZSC-MPCWM descriptor.
  *         When the WaterMark memory supports two sub-regions A and B. pMPCWM_Desc argument must point to an array of
  *         two MPCWM_ConfigTypeDef structures.
  *         The structure description is available in @ref GTZC_Exported_Types.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_GTZC_TZSC_MPCWM_GetConfigMemAttributes(uint32_t MemBaseAddress, MPCWM_ConfigTypeDef *pMPCWM_Desc)
{
  uint32_t register_address;
  uint32_t reg_value;
  uint32_t granularity = (MemBaseAddress == BKPSRAM_BASE) ? \
                         GTZC_TZSC_MPCWM_GRANULARITY_2 : GTZC_TZSC_MPCWM_GRANULARITY_1;

  /* firstly take care of the first area, present on all MPCWM sub-blocks */
  switch (MemBaseAddress)
  {
#if defined(OCTOSPI1)
    case OCTOSPI1_BASE:
      register_address = (uint32_t) &(GTZC_TZSC1->MPCWM1AR);
      break;
#endif /* (OCTOSPI1) */
#if defined(FMC_BANK1)
    case FMC_BANK1:
      register_address = (uint32_t) &(GTZC_TZSC1->MPCWM2AR);
      break;
#endif /* defined(FMC_BANK1) */
#if defined(FMC_BANK3)
    case FMC_BANK3:
      register_address = (uint32_t) &(GTZC_TZSC1->MPCWM3AR);
      break;
#endif /* defined(FMC_BANK3) */
#if defined(FMC_SDRAM_BANK_1)
    case FMC_SDRAM_BANK_1:
      register_address = (uint32_t) &(GTZC_TZSC1->MPCWM3AR);
      break;
#endif /* (FMC_SDRAM_BANK_1) */
#if defined(BKPSRAM_BASE)
    case BKPSRAM_BASE:
      register_address = (uint32_t) &(GTZC_TZSC1->MPCWM4AR);
      break;
#endif /* (BKPSRAM_BASE) */
#if defined(FMC_SDRAM_BANK_2)
    case FMC_SDRAM_BANK_2:
      register_address = (uint32_t) &(GTZC_TZSC1->MPCWM4AR);
      break;
#endif /* (FMC_SDRAM_BANK_2) */
    default:
      return HAL_ERROR;
      break;
  }

  /* read register and update the descriptor for first area*/
  reg_value = READ_REG(*(__IO uint32_t *)register_address);
  pMPCWM_Desc[0].AreaId = GTZC_TZSC_MPCWM_ID1;
  pMPCWM_Desc[0].Offset = ((reg_value & GTZC_TZSC_MPCWMR_SUBZ_START_Msk)
                           >> GTZC_TZSC_MPCWMR_SUBZ_START_Pos) * granularity;
  pMPCWM_Desc[0].Length = ((reg_value & GTZC_TZSC_MPCWMR_SUBZ_LENGTH_Msk)
                           >> GTZC_TZSC_MPCWMR_SUBZ_LENGTH_Pos) * granularity;

